extern crate phf;

pub static CONSONANTS: phf::Map<&'static str, u32> = phf_map! {
    "g" => 0, // => "ㄱ",
    "G" => 1, // => "ㄲ",
    "n" => 2, // => "ㄴ",
    "d" => 3, // => "ㄷ",
    "D" => 4, // => "ㄸ",
    "r" => 5, // => "ㄹ",
    "l" => 5, // => "ㄹ",
    "m" => 6, // => "ㅁ",
    "b" => 7, // => "ㅂ",
    "B" => 8, // => "ㅃ",
    "s" => 9, // => "ㅅ",
    "S" => 10, // => "ㅆ",
    "x" => 11, // => "ㅇ",
    "j" => 12, // => "ㅈ",
    "J" => 13, // => "ㅉ",
    "ch" => 14, // => "ㅊ",
    "k" => 15, // => "ㅋ",
    "t" => 16, // => "ㅌ",
    "p" => 17, // => "ㅍ",
    "h" => 18, // => "ㅎ",
};

// Maps from an "initial" consonant to a final consonant
pub const FINAL_MAP: phf::Map<u32, u32> = phf_map! {
    // 0, //
    0u32 => 1, // ㄱ
    1u32 => 2, // ㄲ
    // 3, // ㄱㅅ
    2u32 => 4, // ㄴ
    // 5, // ㄴㅈ
    // 6, // ㄴㅎ
    3u32 => 7, // ㄷ
    5u32 => 8, // ㄹ
    // 9, // ㄹㄱ
    // 10, // ㄹㅁ
    // 11, // ㄹㅂ
    // 12, // ㄹㅅ
    // 13, // ㄹㅌ
    // 14, // ㄹㅍ
    // 15, // ㄹㅎ
    6u32 => 16, // ㅁ
    7u32 => 17, // ㅂ
    // 18, // ㅂㅅ
    9u32 => 19, // ㅅ
    10u32 => 20, // ㅆ
    11u32 => 21, // ㅇ
    12u32 => 22, // ㅈ
    14u32 => 23, // ㅊ
    15u32 => 24, // ㅋ
    16u32 => 25, // ㅌ
    17u32 => 26, // ㅍ
    18u32 => 27, // ㅎ
};
// FINALS = " ㄱ ㄲ ㄱㅅ ㄴ ㄴㅈ ㄴㅎ ㄷ ㄹ ㄹㄱ ㄹㅁ ㄹㅂ ㄹㅅ ㄹㅌ ㄹㅍ ㄹㅎ ㅁ ㅂ ㅂㅅ ㅅ ㅆ ㅇ ㅈ ㅊ ㅋ ㅌ ㅍ ㅎ".split(" ")

// maps from a MAPPED first final consonant
// to valid INITIAL consonants that may follow it
// (and how much they offset the value of the first consonant)
pub const FINAL_COMBINATION_MAP: phf::Map<u32, phf::Map<u32, u32>> = phf_map! {
    1u32 => phf_map! {
        9u32 => 1, // ㄱㅅ
    },
    4u32 => phf_map! {
        12u32 => 1, // ㄴㅈ
        18u32 => 2, // ㄴㅎ
    },
    5u32 => phf_map! {
        0u32 => 1, // ㄹㄱ
        6u32 => 2, // ㄹㅁ
        7u32 => 3, // ㄹㅂ
        9u32 => 4, // ㄹㅅ
        16u32 => 5, // ㄹㅌ
        17u32 => 6, // ㄹㅍ
        18u32 => 7, // ㄹㅎ
    },
    7u32 => phf_map! {
        9u32 => 1, // ㅂㅅ
    }
};

pub static VOWELS: phf::Map<&'static str, u32> = phf_map! {
    "a" => 0, // => "아",
    "ae" => 1, // => "애",
    "ya" => 2, // => "야",
    "yae" => 3, // => "얘",

    "eo" => 4, // => "어",
    "e" => 5, // => "에",
    "yeo" => 6, // => "여",
    "ye" => 7, // => "예",

    "o" => 8, // => "오",
    "wa" => 9, // => "와",
    "wae" => 10, // => "왜",
    "oe" => 11, // => "외",
    "yo" => 12, // => "요",

    "u" => 13, // => "우",
    "weo" => 14, // => "워",
    "we" => 15, // => "웨",
    "wi" => 16, // => "위",
    "yu" => 17, // => "유",

    "y" => 18, // => "ㅡ",
    "yi" => 19, // => "의",
    "i" => 20, // => "이",
};
